---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireSize.Diameter
zh: 直径、管径
source: html/e4a9047e-c2ed-db31-9e62-b0efc14180c3.htm
---
# Autodesk.Revit.DB.Electrical.WireSize.Diameter Property

**中文**: 直径、管径

Get diameter of wire.

## Syntax (C#)
```csharp
public double Diameter { get; }
```